## Задача від батьків
# Розробник в середньому пише 1000 рядків коду на тиждень.
# При цьому він робить помилки, котрі призводять до появи
# приблизно 30 дефектів.
# Для виправлення одного дефекту він витрачає в середньому
# в 30 разів більше часу, ніж на написання одного рядка
# коду.
# Скільки додатково часу необхідно команді з 4 розробників
# на виправлення дефектів, якщо на написання коду вони вже
# витратили 10 місяців?

developers = int(input ("Введіть кількість розробників в команді: "))
code_months = int(input ("Введіть кількість місяців витрачених на розробку: "))

# Кількість тижнів в 10 місяцях
code_weeks = code_months * 30 // 7

# Кількість рядків коду написана одним розробником
developer_code = 1000 * code_weeks

# Кількість рядків коду написана командою
team_code = developers * developer_code

print("Було написано ", team_code, " рядків коду.")

# Кількість дефектів в коді
team_defects = team_code // 1000 * 30

# Об'єм в рядках роботи по виправленню багів
defects_to_code_lines = team_defects * 30

# Кількість тижнів виправлення багів для одного розробника
debug_developer_weeks = defects_to_code_lines // 1000

# Кількість тижнів виправлення багів для команди
debug_weeks = debug_developer_weeks // developers

debug_months = debug_weeks * 7 // 30

print("Відповідь:")
print("- Варіант 1")
print("  Команді необхідно додатково ", debug_months, " місяців.")

# Співвідношення часу необхідного на виправлення дефектів
# від часу необхідного для написання коду
debug_time_factor = 30 * 30 / 1000

# Кількість тижнів виправлення багів для команди
debug_months = code_months * debug_time_factor

print("- Варіант 2")
print("  Команді необхідно додатково ", int(debug_months), " місяців.")
